# importing

In [105]:
import pandas as pd

# df dataset

In [106]:
df = pd.read_csv("./Task.csv")

In [107]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

# shape of df

In [108]:
df.shape

(1000, 9)

# col Names

In [109]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='str')

# dtypes

In [110]:
df.dtypes

user_id              str
age                  str
salary               str
department           str
join_date            str
city                 str
performance_score    str
experience_years     str
is_active            str
dtype: object

## missing values percentage for each col

In [111]:
df.isnull().sum()/len(df) * 100

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

### columns containing mixed data types

In [112]:
df.apply(lambda col : col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

## user_id by replacing empty strings with NaN and converting to uppercase

In [113]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [114]:
import numpy as np
df['user_id'].replace(to_replace='',value = np.nan).str.upper()

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: str

### convert age to numeric and replace invalid values with NaN

In [115]:
df['age'].dtype

In [116]:
df['age'] = df['age'].apply(lambda x: np.nan if not str(x).isnumeric() else int(x))

df['age'].apply(lambda x: np.nan if x > 100 else x)

0       NaN
1      30.0
2      30.0
3       NaN
4       NaN
       ...
995    60.0
996     NaN
997     NaN
998     NaN
999    30.0
Name: age, Length: 1000, dtype: float64

### 6. clean sal by removing curr sysmbols and converting it to numeric

In [117]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,NaN,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [118]:
df['salary'].dtypes

In [119]:
df['salary'] = df['salary'].astype(str)

In [120]:
# df['salary'] = df['salary'].apply(lambda x : x if isnumeric() else np.nan if x.lower() == "nan" else )

In [121]:
df['salary'] = df['salary'].str.replace("₹", "",regex=False).replace("N/A",np.nan)
df['salary'] = pd.to_numeric(df['salary'], errors = "coerce")

In [122]:
df['salary']

0       50000.00
1       45000.00
2       25000.00
3            NaN
4      120000.75
         ...
995     50000.00
996          NaN
997     25000.00
998     25000.00
999     45000.00
Name: salary, Length: 1000, dtype: float64

In [123]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,NaN,50000.00,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,NaN,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

In [124]:
import datetime
df['join_date'] = pd.to_datetime(df["join_date"], errors = 'coerce',dayfirst=True)

### Extract joining year from the formated date

In [125]:
df['join_year'] = df['join_date'].dt.year
df['join_year']

0      2020.0
1         NaN
2         NaN
3         NaN
4         NaN
        ...
995       NaN
996       NaN
997       NaN
998       NaN
999       NaN
Name: join_year, Length: 1000, dtype: float64

### standardize department values by trimming space and converting to uppercase

In [126]:
df['department'].unique()

<StringArray>
['HR', 'Finance', 'IT', nan, 'Sales', 'it ']
Length: 6, dtype: str

In [127]:
df['department'] = df['department'].str.replace(" ","")
df['department'] = df['department'].str.upper()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.00,HR,2020-01-12,DELHI,3,five,True,2020.0
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

### 10 Normalize city names to a consistent case spelling

In [128]:
df['city'] = df['city'].str.capitalize()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.00,HR,2020-01-12,Delhi,3,five,True,2020.0
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

### 11. convert performance score into numeric by mapping text valuies to numbers.

In [129]:
df['performance_score'].unique()

<StringArray>
['3', 'excellent', nan, '5', 'poor', '4', '1', '2']
Length: 8, dtype: str

In [130]:
df['performance_score'] = df['performance_score'].replace(['excellent','poor'], ['5','1'])
df['performance_score'] = pd.to_numeric(df['performance_score'],errors='coerce')
df['performance_score']

0      3.0
1      3.0
2      5.0
3      5.0
4      NaN
      ...
995    2.0
996    NaN
997    3.0
998    1.0
999    5.0
Name: performance_score, Length: 1000, dtype: float64

### 12. clean exp yrs by converting text values to numeric and removing negatives

In [131]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.00,HR,2020-01-12,Delhi,3.0,five,True,2020.0
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3.0,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,5.0,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,5.0,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,Delhi,2.0,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,user_997,NaN,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,5.0,five,no,NaN

In [132]:
df['experience_years'].unique()

<StringArray>
['five', '1', '10', '5', '-1', '0', nan, '3']
Length: 8, dtype: str

In [133]:
df['experience_years'] = df['experience_years'].replace(['five','-1'],['5',np.nan])
df['experience_years'] = pd.to_numeric(df['experience_years'],errors='coerce')
df['experience_years']

0       5.0
1       1.0
2      10.0
3       5.0
4       NaN
       ...
995     5.0
996     5.0
997     5.0
998     0.0
999     5.0
Name: experience_years, Length: 1000, dtype: float64

### 13. convert is active values (yes/no/true/false) in to boolean format

In [134]:
df['is_active'].unique()

<StringArray>
['True', 'yes', 'False', 'no', nan]
Length: 5, dtype: str

In [135]:
df['is_active'] = df['is_active'].replace(['yes','no'],[True,False])
df['is_active'].unique()

array(['True', True, 'False', False, nan], dtype=object)

### 14. Identify and remove duplicate records based on user_id

In [136]:

df = df.drop_duplicates(subset = ['user_id'])

In [137]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.0,HR,2020-01-12,Delhi,3.0,5.0,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,5.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,5.0,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,200.0,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.0,HR,NaT,Mumbai,3.0,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1.0,0.0,True,NaN

In [138]:
df['user_id'].duplicated().sum()

np.int64(0)

### 15.create a clean final dataframe containing only valid, standardised records

In [139]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.0,HR,2020-01-12,Delhi,3.0,5.0,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,5.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,5.0,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,200.0,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.0,HR,NaT,Mumbai,3.0,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1.0,0.0,True,NaN

In [142]:
df.head()

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,join_year
0,user_0,NaN,50000.0,HR,2020-01-12,Delhi,3.0,5.0,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,5.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,5.0,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN

In [141]:
df.shape

(491, 10)